BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446tim9to14.c
/******************************************************************************
	STM32 446 TIM 9 to 14
Author: Sergio Santos 
	<sergio.salazar.santos@gmail.com>
License: GNU General Public License
Hardware: STM32-446
Date: 22062023
Comment:
	
*******************************************************************************/
/*** File Library ***/
#include "stm32446mapping.h"
#include "stm32446tim9to14.h"

/*** File Procedure & Function Header ***/
/*** Auxiliar 9 to 14 ***/
STM32446TIM9_CR1 stm32446_tim9_cr1_inic(void);
STM32446TIM9_SMCR stm32446_tim9_smcr_inic(void);
STM32446TIM9_DIER stm32446_tim9_dier_inic(void);
STM32446TIM9_SR stm32446_tim9_sr_inic(void);
STM32446TIM9_EGR stm32446_tim9_egr_inic(void);
STM32446TIM9_CCMR1 stm32446_tim9_ccmr1_inic(void);
STM32446TIM9_CCER stm32446_tim9_ccer_inic(void);
STM32446TIM10_CR1 stm32446_tim10_cr1_inic(void);
STM32446TIM10_DIER stm32446_tim10_dier_inic(void);
STM32446TIM10_SR stm32446_tim10_sr_inic(void);
STM32446TIM10_EGR stm32446_tim10_egr_inic(void);
STM32446TIM10_CCMR1 stm32446_tim10_ccmr1_inic(void);
STM32446TIM10_CCER stm32446_tim10_ccer_inic(void);
STM32446TIM11_CR1 stm32446_tim11_cr1_inic(void);
STM32446TIM11_DIER stm32446_tim11_dier_inic(void);
STM32446TIM11_SR stm32446_tim11_sr_inic(void);
STM32446TIM11_EGR stm32446_tim11_egr_inic(void);
STM32446TIM11_CCMR1 stm32446_tim11_ccmr1_inic(void);
STM32446TIM11_CCER stm32446_tim11_ccer_inic(void);
STM32446TIM12_CR1 stm32446_tim12_cr1_inic(void);
STM32446TIM12_SMCR stm32446_tim12_smcr_inic(void);
STM32446TIM12_DIER stm32446_tim12_dier_inic(void);
STM32446TIM12_SR stm32446_tim12_sr_inic(void);
STM32446TIM12_EGR stm32446_tim12_egr_inic(void);
STM32446TIM12_CCMR1 stm32446_tim12_ccmr1_inic(void);
STM32446TIM12_CCER stm32446_tim12_ccer_inic(void);
STM32446TIM13_CR1 stm32446_tim13_cr1_inic(void);
STM32446TIM13_DIER stm32446_tim13_dier_inic(void);
STM32446TIM13_SR stm32446_tim13_sr_inic(void);
STM32446TIM13_EGR stm32446_tim13_egr_inic(void);
STM32446TIM13_CCMR1 stm32446_tim13_ccmr1_inic(void);
STM32446TIM13_CCER stm32446_tim13_ccer_inic(void);
STM32446TIM14_CR1 stm32446_tim14_cr1_inic(void);
STM32446TIM14_DIER stm32446_tim14_dier_inic(void);
STM32446TIM14_SR stm32446_tim14_sr_inic(void);
STM32446TIM14_EGR stm32446_tim14_egr_inic(void);
STM32446TIM14_CCMR1 stm32446_tim14_ccmr1_inic(void);
STM32446TIM14_CCER stm32446_tim14_ccer_inic(void);
/*** TIMER 9 to 14 Procedure & Function Definition ***/
/************/
/*** TIM9 ***/
/************/
void STM32446Tim9Clock(uint8_t bool)
{
	if(bool){
		RCC->APB2ENR |= (1 << 16); // timer 9 clock enabled
	}else{
		RCC->APB2ENR &= ~(1 << 16); //timer 9 clock disabled
	}
}
void STM32446Tim9Nvic(uint8_t bool)
{ // 24
	if(bool){setbit(NVIC->ISER, 1, 24, 1);} else{setbit(NVIC->ICER, 1, 24, 1);}
}
/************************/
/*** TIM9 Bit Mapping ***/
/************************/
// CR1
void STM32446Tim9_ckd(uint8_t value)
{
	setreg(&TIM9->CR1, 2, 8, value);
}
uint8_t STM32446Tim9_get_ckd(void)
{
	return readreg(TIM9->CR1, 2, 8);
}
void STM32446Tim9_set_apre(uint8_t bool)
{
	setreg(&TIM9->CR1, 1, 7, bool);
}
void STM32446Tim9_set_opm(uint8_t bool)
{
	setreg(&TIM9->CR1, 1, 3, bool);
}
void STM32446Tim9_set_urs(uint8_t bool)
{
	setreg(&TIM9->CR1, 1, 2, bool);
}
void STM32446Tim9_set_udis(uint8_t bool)
{
	setreg(&TIM9->CR1, 1, 1, bool);
}
void STM32446Tim9_cen(uint8_t bool)
{
	setreg(&TIM9->CR1, 1, 0, bool);
}
// SMCR
void STM32446Tim9_msm(uint8_t bool)
{
	setreg(&TIM9->SMCR, 1, 7, bool);
}
void STM32446Tim9_ts(uint8_t value)
{
	setreg(&TIM9->SMCR, 3, 4, value);
}
void STM32446Tim9_sms(uint8_t value)
{
	setreg(&TIM9->SMCR, 3, 0, value);
}
// DIER
void STM32446Tim9_tie(uint8_t bool)
{
	setreg(&TIM9->DIER, 1, 6, bool);
}
void STM32446Tim9_cc2ie(uint8_t bool)
{
	setreg(&TIM9->DIER, 1, 2, bool);
}
void STM32446Tim9_cc1ie(uint8_t bool)
{
	setreg(&TIM9->DIER, 1, 1, bool);
}
void STM32446Tim9_uie(uint8_t bool)
{
	setreg(&TIM9->DIER, 1, 0, bool);
}
// SR
uint8_t STM32446Tim9_cc2of(void)
{
	return readreg(TIM9->SR, 1, 10);
}
void STM32446Tim9_clear_cc2of(void)
{
	setreg(&TIM9->SR, 1, 10, 0);
}
uint8_t STM32446Tim9_cc1of(void)
{
	return readreg(TIM9->SR, 1, 9);
}
void STM32446Tim9_clear_cc1of(void)
{
	setreg(&TIM9->SR, 1, 9, 0);
}
uint8_t STM32446Tim9_tif(void)
{
	return readreg(TIM9->SR, 1, 6);
}
void STM32446Tim9_clear_tif(void)
{
	setreg(&TIM9->SR, 1, 6, 0);
}
uint8_t STM32446Tim9_cc2if(void)
{
	return readreg(TIM9->SR, 1, 2);
}
void STM32446Tim9_clear_cc2if(void)
{
	setreg(&TIM9->SR, 1, 2, 0);
}
uint8_t STM32446Tim9_cc1if(void)
{
	return readreg(TIM9->SR, 1, 1);
}
void STM32446Tim9_clear_cc1if(void)
{
	setreg(&TIM9->SR, 1, 1, 0);
}
uint8_t STM32446Tim9_uif(void)
{
	return readreg(TIM9->SR, 1, 0);
}
void STM32446Tim9_clear_uif(void)
{
	setreg(&TIM9->SR, 1, 0, 0);
}
// EGR
void STM32446Tim9_tg(void)
{
	setreg(&TIM9->EGR, 1, 6, 1);
}
void STM32446Tim9_cc2g(void)
{
	setreg(&TIM9->EGR, 1, 2, 1);
}
void STM32446Tim9_cc1g(void)
{
	setreg(&TIM9->EGR, 1, 1, 1);
}
void STM32446Tim9_ug(void)
{
	setreg(&TIM9->EGR, 1, 0, 1);
}
// CCMR1
void STM32446Tim9_oc2m(uint8_t value)
{
	setreg(&TIM9->CCMR1, 3, 12, value);
}
void STM32446Tim9_ic2f(uint8_t value)
{
	setreg(&TIM9->CCMR1, 4, 12, value);
}
void STM32446Tim9_oc2pe(uint8_t bool)
{
	setreg(&TIM9->CCMR1, 1, 11, bool);
}
void STM32446Tim9_oc2fe(uint8_t bool)
{
	setreg(&TIM9->CCMR1, 1, 10, bool);
}
void STM32446Tim9_ic2psc(uint8_t value)
{
	setreg(&TIM9->CCMR1, 2, 10, value);
}
void STM32446Tim9_cc2s(uint8_t value)
{
	setreg(&TIM9->CCMR1, 2, 8, value);
}
void STM32446Tim9_oc1m(uint8_t value)
{
	setreg(&TIM9->CCMR1, 3, 4, value);
}
void STM32446Tim9_ic1f(uint8_t value)
{
	setreg(&TIM9->CCMR1, 4, 4, value);
}
void STM32446Tim9_oc1pe(uint8_t bool)
{
	setreg(&TIM9->CCMR1, 1, 3, bool);
}
void STM32446Tim9_oc1fe(uint8_t bool)
{
	setreg(&TIM9->CCMR1, 1, 2, bool);
}
void STM32446Tim9_ic1psc(uint8_t value)
{
	setreg(&TIM9->CCMR1, 2, 2, value);
}
void STM32446Tim9_cc1s(uint8_t value)
{
	setreg(&TIM9->CCMR1, 2, 0, value);
}
// CCER
void STM32446Tim9_cc2np(uint8_t bool)
{
	setreg(&TIM9->CCER, 1, 7, bool);
}
void STM32446Tim9_cc2p(uint8_t bool)
{
	setreg(&TIM9->CCER, 1, 5, bool);
}
void STM32446Tim9_cc2e(uint8_t bool)
{
	setreg(&TIM9->CCER, 1, 4, bool);
}
void STM32446Tim9_cc1np(uint8_t bool)
{
	setreg(&TIM9->CCER, 1, 3, bool);
}
void STM32446Tim9_cc1p(uint8_t bool)
{
	setreg(&TIM9->CCER, 1, 1, bool);
}
void STM32446Tim9_cc1e(uint8_t bool)
{
	setreg(&TIM9->CCER, 1, 0, bool);
}
// CNT
void STM32446Tim9_cnt(uint16_t value)
{
	TIM9->CNT = value;
}
uint16_t STM32446Tim9_get_cnt(void)
{
	return TIM9->CNT;
}
// ARR
void STM32446Tim9_arr(uint16_t value)
{
	TIM9->ARR = value;
}
// CCR1
void STM32446Tim9_ccr1(uint16_t value)
{
	TIM9->CCR1 = value;
}
// CCR2
void STM32446Tim9_ccr2(uint16_t value)
{
	TIM9->CCR2 = value;
}
// PSC
void STM32446Tim9_psc(uint16_t value)
{
	TIM9->PSC = value;
}
/*************/
/*** TIM10 ***/
/*************/
void STM32446Tim10Clock(uint8_t bool)
{
	if(bool){
		RCC->APB2ENR |= (1 << 17); // timer 10 clock enabled
	}else{
		RCC->APB2ENR &= ~(1 << 17); //timer 10 clock disabled
	}
}
void STM32446Tim10Nvic(uint8_t bool)
{ // 25
	if(bool){setbit(NVIC->ISER, 1, 25, 1);} else{setbit(NVIC->ICER, 1, 25, 1);}
}
/*************************/
/*** TIM10 Bit Mapping ***/
/*************************/
// CR1
void STM32446Tim10_ckd(uint8_t value)
{
	setreg(&TIM9->CR1, 2, 8, value);
}
uint8_t STM32446Tim10_get_ckd(void)
{
	return readreg(TIM10->CR1, 2, 8);
}
void STM32446Tim10_set_apre(uint8_t bool)
{
	setreg(&TIM10->CR1, 1, 7, bool);
}
void STM32446Tim10_set_opm(uint8_t bool)
{
	setreg(&TIM10->CR1, 1, 3, bool);
}
void STM32446Tim10_set_urs(uint8_t bool)
{
	setreg(&TIM10->CR1, 1, 2, bool);
}
void STM32446Tim10_set_udis(uint8_t bool)
{
	setreg(&TIM10->CR1, 1, 1, bool);
}
void STM32446Tim10_cen(uint8_t bool)
{
	setreg(&TIM10->CR1, 1, 0, bool);
}
// DIER
void STM32446Tim10_tie(uint8_t bool)
{
	setreg(&TIM10->DIER, 1, 6, bool);
}
void STM32446Tim10_cc2ie(uint8_t bool)
{
	setreg(&TIM10->DIER, 1, 2, bool);
}
void STM32446Tim10_cc1ie(uint8_t bool)
{
	setreg(&TIM10->DIER, 1, 1, bool);
}
void STM32446Tim10_uie(uint8_t bool)
{
	setreg(&TIM10->DIER, 1, 0, bool);
}
// SR
uint8_t STM32446Tim10_cc2of(void)
{
	return readreg(TIM10->SR, 1, 10);
}
void STM32446Tim10_clear_cc2of(void)
{
	setreg(&TIM10->SR, 1, 10, 0);
}
uint8_t STM32446Tim10_cc1of(void)
{
	return readreg(TIM10->SR, 1, 9);
}
void STM32446Tim10_clear_cc1of(void)
{
	setreg(&TIM10->SR, 1, 9, 0);
}
uint8_t STM32446Tim10_tif(void)
{
	return readreg(TIM10->SR, 1, 6);
}
void STM32446Tim10_clear_tif(void)
{
	setreg(&TIM10->SR, 1, 6, 0);
}
uint8_t STM32446Tim10_cc2if(void)
{
	return readreg(TIM10->SR, 1, 2);
}
void STM32446Tim10_clear_cc2if(void)
{
	setreg(&TIM10->SR, 1, 2, 0);
}
uint8_t STM32446Tim10_cc1if(void)
{
	return readreg(TIM10->SR, 1, 1);
}
void STM32446Tim10_clear_cc1if(void)
{
	setreg(&TIM10->SR, 1, 1, 0);
}
uint8_t STM32446Tim10_uif(void)
{
	return readreg(TIM10->SR, 1, 0);
}
void STM32446Tim10_clear_uif(void)
{
	setreg(&TIM10->SR, 1, 0, 0);
}
// EGR
void STM32446Tim10_tg(void)
{
	setreg(&TIM10->EGR, 1, 6, 1);
}
void STM32446Tim10_cc2g(void)
{
	setreg(&TIM10->EGR, 1, 2, 1);
}
void STM32446Tim10_cc1g(void)
{
	setreg(&TIM10->EGR, 1, 1, 1);
}
void STM32446Tim10_ug(void)
{
	setreg(&TIM10->EGR, 1, 0, 1);
}
// CCMR1
void STM32446Tim10_oc2m(uint8_t value)
{
	setreg(&TIM10->CCMR1, 3, 12, value);
}
void STM32446Tim10_ic2f(uint8_t value)
{
	setreg(&TIM10->CCMR1, 4, 12, value);
}
void STM32446Tim10_oc2pe(uint8_t bool)
{
	setreg(&TIM10->CCMR1, 1, 11, bool);
}
void STM32446Tim10_oc2fe(uint8_t bool)
{
	setreg(&TIM10->CCMR1, 1, 10, bool);
}
void STM32446Tim10_ic2psc(uint8_t value)
{
	setreg(&TIM10->CCMR1, 2, 10, value);
}
void STM32446Tim10_cc2s(uint8_t value)
{
	setreg(&TIM10->CCMR1, 2, 8, value);
}
void STM32446Tim10_oc1m(uint8_t value)
{
	setreg(&TIM10->CCMR1, 3, 4, value);
}
void STM32446Tim10_ic1f(uint8_t value)
{
	setreg(&TIM10->CCMR1, 4, 4, value);
}
void STM32446Tim10_oc1pe(uint8_t bool)
{
	setreg(&TIM10->CCMR1, 1, 3, bool);
}
void STM32446Tim10_oc1fe(uint8_t bool)
{
	setreg(&TIM10->CCMR1, 1, 2, bool);
}
void STM32446Tim10_ic1psc(uint8_t value)
{
	setreg(&TIM10->CCMR1, 2, 2, value);
}
void STM32446Tim10_cc1s(uint8_t value)
{
	setreg(&TIM10->CCMR1, 2, 0, value);
}
// CCER
void STM32446Tim10_cc2np(uint8_t bool)
{
	setreg(&TIM10->CCER, 1, 7, bool);
}
void STM32446Tim10_cc2p(uint8_t bool)
{
	setreg(&TIM10->CCER, 1, 5, bool);
}
void STM32446Tim10_cc2e(uint8_t bool)
{
	setreg(&TIM10->CCER, 1, 4, bool);
}
void STM32446Tim10_cc1np(uint8_t bool)
{
	setreg(&TIM10->CCER, 1, 3, bool);
}
void STM32446Tim10_cc1p(uint8_t bool)
{
	setreg(&TIM10->CCER, 1, 1, bool);
}
void STM32446Tim10_cc1e(uint8_t bool)
{
	setreg(&TIM10->CCER, 1, 0, bool);
}
// CNT
void STM32446Tim10_cnt(uint16_t value)
{
	TIM10->CNT = value;
}
uint16_t STM32446Tim10_get_cnt(void)
{
	return TIM10->CNT;
}
// PSC
void STM32446Tim10_psc(uint16_t value)
{
	TIM10->PSC = value;
}
// ARR
void STM32446Tim10_arr(uint16_t value)
{
	TIM10->ARR = value;
}
// CCR1
void STM32446Tim10_ccr1(uint16_t value)
{
	TIM10->CCR1 = value;
}
// OR
void STM32446Tim10_or(uint8_t value)
{
	setreg(&TIM10->OR, 2, 0, value);
}
/*************/
/*** TIM11 ***/
/*************/
void STM32446Tim11Clock(uint8_t bool)
{
	if(bool){
		RCC->APB2ENR |= (1 << 18); // timer 11 clock enabled
	}else{
		RCC->APB2ENR &= ~(1 << 18); //timer 11 clock disabled
	}
}
void STM32446Tim11Nvic(uint8_t bool)
{ // 26
	if(bool){setbit(NVIC->ISER, 1, 26, 1);} else{setbit(NVIC->ICER, 1, 26, 1);}
}
/************************/
/*** TIM11 Bit Mapping ***/
/************************/
// CR1
void STM32446Tim11_ckd(uint8_t value)
{
	setreg(&TIM9->CR1, 2, 8, value);
}
uint8_t STM32446Tim11_get_ckd(void)
{
	return readreg(TIM11->CR1, 2, 8);
}
void STM32446Tim11_set_apre(uint8_t bool)
{
	setreg(&TIM11->CR1, 1, 7, bool);
}
void STM32446Tim11_set_opm(uint8_t bool)
{
	setreg(&TIM11->CR1, 1, 3, bool);
}
void STM32446Tim11_set_urs(uint8_t bool)
{
	setreg(&TIM11->CR1, 1, 2, bool);
}
void STM32446Tim11_set_udis(uint8_t bool)
{
	setreg(&TIM11->CR1, 1, 1, bool);
}
void STM32446Tim11_cen(uint8_t bool)
{
	setreg(&TIM11->CR1, 1, 0, bool);
}
// DIER
void STM32446Tim11_tie(uint8_t bool)
{
	setreg(&TIM11->DIER, 1, 6, bool);
}
void STM32446Tim11_cc2ie(uint8_t bool)
{
	setreg(&TIM11->DIER, 1, 2, bool);
}
void STM32446Tim11_cc1ie(uint8_t bool)
{
	setreg(&TIM11->DIER, 1, 1, bool);
}
void STM32446Tim11_uie(uint8_t bool)
{
	setreg(&TIM11->DIER, 1, 0, bool);
}
// SR
uint8_t STM32446Tim11_cc2of(void)
{
	return readreg(TIM11->SR, 1, 10);
}
void STM32446Tim11_clear_cc2of(void)
{
	setreg(&TIM11->SR, 1, 10, 0);
}
uint8_t STM32446Tim11_cc1of(void)
{
	return readreg(TIM11->SR, 1, 9);
}
void STM32446Tim11_clear_cc1of(void)
{
	setreg(&TIM11->SR, 1, 9, 0);
}
uint8_t STM32446Tim11_tif(void)
{
	return readreg(TIM11->SR, 1, 6);
}
void STM32446Tim11_clear_tif(void)
{
	setreg(&TIM11->SR, 1, 6, 0);
}
uint8_t STM32446Tim11_cc2if(void)
{
	return readreg(TIM11->SR, 1, 2);
}
void STM32446Tim11_clear_cc2if(void)
{
	setreg(&TIM11->SR, 1, 2, 0);
}
uint8_t STM32446Tim11_cc1if(void)
{
	return readreg(TIM11->SR, 1, 1);
}
void STM32446Tim11_clear_cc1if(void)
{
	setreg(&TIM11->SR, 1, 1, 0);
}
uint8_t STM32446Tim11_uif(void)
{
	return readreg(TIM11->SR, 1, 0);
}
void STM32446Tim11_clear_uif(void)
{
	setreg(&TIM11->SR, 1, 0, 0);
}
// EGR
void STM32446Tim11_tg(void)
{
	setreg(&TIM11->EGR, 1, 6, 1);
}
void STM32446Tim11_cc2g(void)
{
	setreg(&TIM11->EGR, 1, 2, 1);
}
void STM32446Tim11_cc1g(void)
{
	setreg(&TIM11->EGR, 1, 1, 1);
}
void STM32446Tim11_ug(void)
{
	setreg(&TIM11->EGR, 1, 0, 1);
}
// CCMR1
void STM32446Tim11_oc2m(uint8_t value)
{
	setreg(&TIM11->CCMR1, 3, 12, value);
}
void STM32446Tim11_ic2f(uint8_t value)
{
	setreg(&TIM11->CCMR1, 4, 12, value);
}
void STM32446Tim11_oc2pe(uint8_t bool)
{
	setreg(&TIM11->CCMR1, 1, 11, bool);
}
void STM32446Tim11_oc2fe(uint8_t bool)
{
	setreg(&TIM11->CCMR1, 1, 10, bool);
}
void STM32446Tim11_ic2psc(uint8_t value)
{
	setreg(&TIM11->CCMR1, 2, 10, value);
}
void STM32446Tim11_cc2s(uint8_t value)
{
	setreg(&TIM11->CCMR1, 2, 8, value);
}
void STM32446Tim11_oc1m(uint8_t value)
{
	setreg(&TIM11->CCMR1, 3, 4, value);
}
void STM32446Tim11_ic1f(uint8_t value)
{
	setreg(&TIM11->CCMR1, 4, 4, value);
}
void STM32446Tim11_oc1pe(uint8_t bool)
{
	setreg(&TIM11->CCMR1, 1, 3, bool);
}
void STM32446Tim11_oc1fe(uint8_t bool)
{
	setreg(&TIM11->CCMR1, 1, 2, bool);
}
void STM32446Tim11_ic1psc(uint8_t value)
{
	setreg(&TIM11->CCMR1, 2, 2, value);
}
void STM32446Tim11_cc1s(uint8_t value)
{
	setreg(&TIM11->CCMR1, 2, 0, value);
}
// CCER
void STM32446Tim11_cc2np(uint8_t bool)
{
	setreg(&TIM11->CCER, 1, 7, bool);
}
void STM32446Tim11_cc2p(uint8_t bool)
{
	setreg(&TIM11->CCER, 1, 5, bool);
}
void STM32446Tim11_cc2e(uint8_t bool)
{
	setreg(&TIM11->CCER, 1, 4, bool);
}
void STM32446Tim11_cc1np(uint8_t bool)
{
	setreg(&TIM11->CCER, 1, 3, bool);
}
void STM32446Tim11_cc1p(uint8_t bool)
{
	setreg(&TIM11->CCER, 1, 1, bool);
}
void STM32446Tim11_cc1e(uint8_t bool)
{
	setreg(&TIM11->CCER, 1, 0, bool);
}
// CNT
void STM32446Tim11_cnt(uint16_t value)
{
	TIM11->CNT = value;
}
uint16_t STM32446Tim11_get_cnt(void)
{
	return TIM11->CNT;
}
// PSC
void STM32446Tim11_psc(uint16_t value)
{
	TIM11->PSC = value;
}
// ARR
void STM32446Tim11_arr(uint16_t value)
{
	TIM11->ARR = value;
}
// CCR1
void STM32446Tim11_ccr1(uint16_t value)
{
	TIM11->CCR1 = value;
}
// OR
void STM32446Tim11_or(uint8_t value)
{
	setreg(&TIM11->OR, 2, 0, value);
}
/*************/
/*** TIM12 ***/
/*************/
void STM32446Tim12Clock(uint8_t bool)
{
	if(bool){
		RCC->APB1ENR |= (1 << 6); // timer 12 clock enabled
	}else{
		RCC->APB1ENR &= ~(1 << 6); //timer 12 clock disabled
	}
}
void STM32446Tim12Nvic(uint8_t bool)
{ // 43
	if(bool){setbit(NVIC->ISER, 1, 43, 1);}else{setbit(NVIC->ICER, 1, 43, 1);}
}
/************************/
/*** TIM12 Bit Mapping ***/
/************************/
// CR1
void STM32446Tim12_ckd(uint8_t value)
{
	setreg(&TIM9->CR1, 2, 8, value);
}
uint8_t STM32446Tim12_get_ckd(void)
{
	return readreg(TIM12->CR1, 2, 8);
}
void STM32446Tim12_set_apre(uint8_t bool)
{
	setreg(&TIM12->CR1, 1, 7, bool);
}
void STM32446Tim12_set_opm(uint8_t bool)
{
	setreg(&TIM12->CR1, 1, 3, bool);
}
void STM32446Tim12_set_urs(uint8_t bool)
{
	setreg(&TIM12->CR1, 1, 2, bool);
}
void STM32446Tim12_set_udis(uint8_t bool)
{
	setreg(&TIM12->CR1, 1, 1, bool);
}
void STM32446Tim12_cen(uint8_t bool)
{
	setreg(&TIM12->CR1, 1, 0, bool);
}
// SMCR
void STM32446Tim12_msm(uint8_t bool)
{
	setreg(&TIM12->SMCR, 1, 7, bool);
}
void STM32446Tim12_ts(uint8_t value)
{
	setreg(&TIM12->SMCR, 3, 4, value);
}
void STM32446Tim12_sms(uint8_t value)
{
	setreg(&TIM12->SMCR, 3, 0, value);
}
// DIER
void STM32446Tim12_tie(uint8_t bool)
{
	setreg(&TIM12->DIER, 1, 6, bool);
}
void STM32446Tim12_cc2ie(uint8_t bool)
{
	setreg(&TIM12->DIER, 1, 2, bool);
}
void STM32446Tim12_cc1ie(uint8_t bool)
{
	setreg(&TIM12->DIER, 1, 1, bool);
}
void STM32446Tim12_uie(uint8_t bool)
{
	setreg(&TIM12->DIER, 1, 0, bool);
}
// SR
uint8_t STM32446Tim12_cc2of(void)
{
	return readreg(TIM12->SR, 1, 10);
}
void STM32446Tim12_clear_cc2of(void)
{
	setreg(&TIM12->SR, 1, 10, 0);
}
uint8_t STM32446Tim12_cc1of(void)
{
	return readreg(TIM12->SR, 1, 9);
}
void STM32446Tim12_clear_cc1of(void)
{
	setreg(&TIM12->SR, 1, 9, 0);
}
uint8_t STM32446Tim12_tif(void)
{
	return readreg(TIM12->SR, 1, 6);
}
void STM32446Tim12_clear_tif(void)
{
	setreg(&TIM12->SR, 1, 6, 0);
}
uint8_t STM32446Tim12_cc2if(void)
{
	return readreg(TIM12->SR, 1, 2);
}
void STM32446Tim12_clear_cc2if(void)
{
	setreg(&TIM12->SR, 1, 2, 0);
}
uint8_t STM32446Tim12_cc1if(void)
{
	return readreg(TIM12->SR, 1, 1);
}
void STM32446Tim12_clear_cc1if(void)
{
	setreg(&TIM12->SR, 1, 1, 0);
}
uint8_t STM32446Tim12_uif(void)
{
	return readreg(TIM12->SR, 1, 0);
}
void STM32446Tim12_clear_uif(void)
{
	setreg(&TIM12->SR, 1, 0, 0);
}
// EGR
void STM32446Tim12_tg(void)
{
	setreg(&TIM12->EGR, 1, 6, 1);
}
void STM32446Tim12_cc2g(void)
{
	setreg(&TIM12->EGR, 1, 2, 1);
}
void STM32446Tim12_cc1g(void)
{
	setreg(&TIM12->EGR, 1, 1, 1);
}
void STM32446Tim12_ug(void)
{
	setreg(&TIM12->EGR, 1, 0, 1);
}
// CCMR1
void STM32446Tim12_oc2m(uint8_t value)
{
	setreg(&TIM12->CCMR1, 3, 12, value);
}
void STM32446Tim12_ic2f(uint8_t value)
{
	setreg(&TIM12->CCMR1, 4, 12, value);
}
void STM32446Tim12_oc2pe(uint8_t bool)
{
	setreg(&TIM12->CCMR1, 1, 11, bool);
}
void STM32446Tim12_oc2fe(uint8_t bool)
{
	setreg(&TIM12->CCMR1, 1, 10, bool);
}
void STM32446Tim12_ic2psc(uint8_t value)
{
	setreg(&TIM12->CCMR1, 2, 10, value);
}
void STM32446Tim12_cc2s(uint8_t value)
{
	setreg(&TIM12->CCMR1, 2, 8, value);
}
void STM32446Tim12_oc1m(uint8_t value)
{
	setreg(&TIM12->CCMR1, 3, 4, value);
}
void STM32446Tim12_ic1f(uint8_t value)
{
	setreg(&TIM12->CCMR1, 4, 4, value);
}
void STM32446Tim12_oc1pe(uint8_t bool)
{
	setreg(&TIM12->CCMR1, 1, 3, bool);
}
void STM32446Tim12_oc1fe(uint8_t bool)
{
	setreg(&TIM12->CCMR1, 1, 2, bool);
}
void STM32446Tim12_ic1psc(uint8_t value)
{
	setreg(&TIM12->CCMR1, 2, 2, value);
}
void STM32446Tim12_cc1s(uint8_t value)
{
	setreg(&TIM12->CCMR1, 2, 0, value);
}
// CCER
void STM32446Tim12_cc2np(uint8_t bool)
{
	setreg(&TIM12->CCER, 1, 7, bool);
}
void STM32446Tim12_cc2p(uint8_t bool)
{
	setreg(&TIM12->CCER, 1, 5, bool);
}
void STM32446Tim12_cc2e(uint8_t bool)
{
	setreg(&TIM12->CCER, 1, 4, bool);
}
void STM32446Tim12_cc1np(uint8_t bool)
{
	setreg(&TIM12->CCER, 1, 3, bool);
}
void STM32446Tim12_cc1p(uint8_t bool)
{
	setreg(&TIM12->CCER, 1, 1, bool);
}
void STM32446Tim12_cc1e(uint8_t bool)
{
	setreg(&TIM12->CCER, 1, 0, bool);
}
// CNT
void STM32446Tim12_cnt(uint16_t value)
{
	TIM12->CNT = value;
}
uint16_t STM32446Tim12_get_cnt(void)
{
	return TIM12->CNT;
}
// ARR
void STM32446Tim12_arr(uint16_t value)
{
	TIM12->ARR = value;
}
// CCR1
void STM32446Tim12_ccr1(uint16_t value)
{
	TIM12->CCR1 = value;
}
// CCR2
void STM32446Tim12_ccr2(uint16_t value)
{
	TIM12->CCR2 = value;
}
// PSC
void STM32446Tim12_psc(uint16_t value)
{
	TIM12->PSC = value;
}
/*************/
/*** TIM13 ***/
/*************/
void STM32446Tim13Clock(uint8_t bool)
{
	if(bool){
		RCC->APB1ENR |= (1 << 7); // timer 13 clock enabled
	}else{
		RCC->APB1ENR &= ~(1 << 7); //timer 13 clock disabled
	}
}
void STM32446Tim13Nvic(uint8_t bool)
{ // 44
	if(bool){setbit(NVIC->ISER, 1, 44, 1);}else{setbit(NVIC->ICER, 1, 44, 1);}
}
/************************/
/*** TIM13 Bit Mapping ***/
/************************/
// CR1
void STM32446Tim13_ckd(uint8_t value)
{
	setreg(&TIM9->CR1, 2, 8, value);
}
uint8_t STM32446Tim13_get_ckd(void)
{
	return readreg(TIM13->CR1, 2, 8);
}
void STM32446Tim13_set_apre(uint8_t bool)
{
	setreg(&TIM13->CR1, 1, 7, bool);
}
void STM32446Tim13_set_opm(uint8_t bool)
{
	setreg(&TIM13->CR1, 1, 3, bool);
}
void STM32446Tim13_set_urs(uint8_t bool)
{
	setreg(&TIM13->CR1, 1, 2, bool);
}
void STM32446Tim13_set_udis(uint8_t bool)
{
	setreg(&TIM13->CR1, 1, 1, bool);
}
void STM32446Tim13_cen(uint8_t bool)
{
	setreg(&TIM13->CR1, 1, 0, bool);
}
// DIER
void STM32446Tim13_tie(uint8_t bool)
{
	setreg(&TIM13->DIER, 1, 6, bool);
}
void STM32446Tim13_cc2ie(uint8_t bool)
{
	setreg(&TIM13->DIER, 1, 2, bool);
}
void STM32446Tim13_cc1ie(uint8_t bool)
{
	setreg(&TIM13->DIER, 1, 1, bool);
}
void STM32446Tim13_uie(uint8_t bool)
{
	setreg(&TIM13->DIER, 1, 0, bool);
}
// SR
uint8_t STM32446Tim13_cc2of(void)
{
	return readreg(TIM13->SR, 1, 10);
}
void STM32446Tim13_clear_cc2of(void)
{
	setreg(&TIM13->SR, 1, 10, 0);
}
uint8_t STM32446Tim13_cc1of(void)
{
	return readreg(TIM13->SR, 1, 9);
}
void STM32446Tim13_clear_cc1of(void)
{
	setreg(&TIM13->SR, 1, 9, 0);
}
uint8_t STM32446Tim13_tif(void)
{
	return readreg(TIM13->SR, 1, 6);
}
void STM32446Tim13_clear_tif(void)
{
	setreg(&TIM13->SR, 1, 6, 0);
}
uint8_t STM32446Tim13_cc2if(void)
{
	return readreg(TIM13->SR, 1, 2);
}
void STM32446Tim13_clear_cc2if(void)
{
	setreg(&TIM13->SR, 1, 2, 0);
}
uint8_t STM32446Tim13_cc1if(void)
{
	return readreg(TIM13->SR, 1, 1);
}
void STM32446Tim13_clear_cc1if(void)
{
	setreg(&TIM13->SR, 1, 1, 0);
}
uint8_t STM32446Tim13_uif(void)
{
	return readreg(TIM13->SR, 1, 0);
}
void STM32446Tim13_clear_uif(void)
{
	setreg(&TIM13->SR, 1, 0, 0);
}
// EGR
void STM32446Tim13_tg(void)
{
	setreg(&TIM13->EGR, 1, 6, 1);
}
void STM32446Tim13_cc2g(void)
{
	setreg(&TIM13->EGR, 1, 2, 1);
}
void STM32446Tim13_cc1g(void)
{
	setreg(&TIM13->EGR, 1, 1, 1);
}
void STM32446Tim13_ug(void)
{
	setreg(&TIM13->EGR, 1, 0, 1);
}
// CCMR1
void STM32446Tim13_oc2m(uint8_t value)
{
	setreg(&TIM13->CCMR1, 3, 12, value);
}
void STM32446Tim13_ic2f(uint8_t value)
{
	setreg(&TIM13->CCMR1, 4, 12, value);
}
void STM32446Tim13_oc2pe(uint8_t bool)
{
	setreg(&TIM13->CCMR1, 1, 11, bool);
}
void STM32446Tim13_oc2fe(uint8_t bool)
{
	setreg(&TIM13->CCMR1, 1, 10, bool);
}
void STM32446Tim13_ic2psc(uint8_t value)
{
	setreg(&TIM13->CCMR1, 2, 10, value);
}
void STM32446Tim13_cc2s(uint8_t value)
{
	setreg(&TIM13->CCMR1, 2, 8, value);
}
void STM32446Tim13_oc1m(uint8_t value)
{
	setreg(&TIM13->CCMR1, 3, 4, value);
}
void STM32446Tim13_ic1f(uint8_t value)
{
	setreg(&TIM13->CCMR1, 4, 4, value);
}
void STM32446Tim13_oc1pe(uint8_t bool)
{
	setreg(&TIM13->CCMR1, 1, 3, bool);
}
void STM32446Tim13_oc1fe(uint8_t bool)
{
	setreg(&TIM13->CCMR1, 1, 2, bool);
}
void STM32446Tim13_ic1psc(uint8_t value)
{
	setreg(&TIM13->CCMR1, 2, 2, value);
}
void STM32446Tim13_cc1s(uint8_t value)
{
	setreg(&TIM13->CCMR1, 2, 0, value);
}
// CCER
void STM32446Tim13_cc2np(uint8_t bool)
{
	setreg(&TIM13->CCER, 1, 7, bool);
}
void STM32446Tim13_cc2p(uint8_t bool)
{
	setreg(&TIM13->CCER, 1, 5, bool);
}
void STM32446Tim13_cc2e(uint8_t bool)
{
	setreg(&TIM13->CCER, 1, 4, bool);
}
void STM32446Tim13_cc1np(uint8_t bool)
{
	setreg(&TIM13->CCER, 1, 3, bool);
}
void STM32446Tim13_cc1p(uint8_t bool)
{
	setreg(&TIM13->CCER, 1, 1, bool);
}
void STM32446Tim13_cc1e(uint8_t bool)
{
	setreg(&TIM13->CCER, 1, 0, bool);
}
// CNT
void STM32446Tim13_cnt(uint16_t value)
{
	TIM13->CNT = value;
}
uint16_t STM32446Tim13_get_cnt(void)
{
	return TIM13->CNT;
}
// PSC
void STM32446Tim13_psc(uint16_t value)
{
	TIM13->PSC = value;
}
